odoo-19.0+e.20260101/odoo/addons/l10n_us_direct_deposit/tests/mocked_responses/create_quote_response.json

{
  "targetAmount": 20,
  "guaranteedTargetAmountAllowed": false,
  "targetAmountAllowed": true,
  "paymentOptions": [
    {
      "formattedEstimatedDelivery": "by Monday",
      "estimatedDeliveryDelays": [],
      "allowedProfileTypes": [
        "PERSONAL",
        "BUSINESS"
      ],
      "feePercentage": 0.1289,
      "estimatedDelivery": "2025-10-06T16:30:00Z",
      "payIn": "DIRECT_DEBIT",
      "price": {
        "priceSetId": 626,
        "total": {
          "type": "TOTAL",
          "label": "Total fees",
          "value": {
            "amount": 2.96,
            "currency": "USD",
            "label": "2.96 USD"
          }
        },
        "items": [
          {
            "type": "PAYIN",
            "label": "fee",
            "value": {
              "amount": 0.04,
              "currency": "USD",
              "label": "0.04 USD"
            }
          },
          {
            "type": "TRANSFERWISE",
            "label": "Our fee",
            "value": {
              "amount": 2.92,
              "currency": "USD",
              "label": "2.92 USD"
            }
          }
        ],
        "priceDecisionReferenceId": "66eb3818-825b-42b1-906a-f0cc81f254d2"
      },
      "fee": {
        "transferwise": 2.92,
        "payIn": 0.04,
        "discount": 0,
        "total": 2.96,
        "priceSetId": 626,
        "partner": 0
      },
      "disabled": false,
      "sourceAmount": 22.96,
      "targetAmount": 20,
      "sourceCurrency": "USD",
      "targetCurrency": "USD",
      "payOut": "BANK_TRANSFER"
    },
    {
      "formattedEstimatedDelivery": "by Tuesday",
      "estimatedDeliveryDelays": [],
      "allowedProfileTypes": [
        "PERSONAL",
        "BUSINESS"
      ],
      "feePercentage": 0.0535,
      "estimatedDelivery": "2025-10-07T12:30:00Z",
      "payIn": "BALANCE",
      "price": {
        "priceSetId": 625,
        "total": {
          "type": "TOTAL",
          "label": "Total fees",
          "value": {
            "amount": 1.13,
            "currency": "USD",
            "label": "1.13 USD"
          }
        },
        "items": [
          {
            "type": "PAYIN",
            "label": "fee",
            "value": {
              "amount": 0,
              "currency": "USD",
              "label": "0 USD"
            }
          },
          {
            "type": "TRANSFERWISE",
            "label": "Our fee",
            "value": {
              "amount": 1.13,
              "currency": "USD",
              "label": "1.13 USD"
            }
          }
        ],
        "priceDecisionReferenceId": "66eb3818-825b-42b1-906a-f0cc81f254d2"
      },
      "fee": {
        "transferwise": 1.13,
        "payIn": 0,
        "discount": 0,
        "total": 1.13,
        "priceSetId": 625,
        "partner": 0
      },
      "disabled": false,
      "sourceAmount": 21.13,
      "targetAmount": 20,
      "sourceCurrency": "USD",
      "targetCurrency": "USD",
      "payOut": "BANK_TRANSFER"
    }
  ],
  "notices": [],
  "transferFlowConfig": {
    "highAmount": {
      "showFeePercentage": false,
      "trackAsHighAmountSender": false,
      "showEducationStep": false,
      "offerPrefundingOption": false,
      "overLimitThroughCs": false,
      "overLimitThroughWiseAccount": false
    }
  },
  "rateTimestamp": "2025-10-06T18:34:48Z",
  "targetAccountDetailsOwnedByProfile": false,
  "clientId": "transferwise-personal-tokens",
  "expectedFulfillmentTime": "2025-10-06T00:00:00Z",
  "sourceCurrency": "USD",
  "targetCurrency": "USD",
  "guaranteedTargetAmount": false,
  "user": 13178110,
  "profile": 28897804,
  "rate": 1,
  "rateExpirationTime": "2025-11-05T18:34:48Z",
  "providedAmountType": "TARGET",
  "targetAccount": 701629658,
  "payInCountry": "EE",
  "payOutCountry": "US",
  "createdTime": "2025-10-06T18:34:48Z",
  "rateType": "FIXED",
  "payOut": "BANK_TRANSFER",
  "funding": "POST",
  "status": "PENDING",
  "expirationTime": "2025-10-06T19:04:48Z",
  "id": "1",
  "type": "REGULAR"
}
